app/controllers/api/boards_controller.rb

INSERT INTO "boards" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "HIHELLO"], ["author_id", 10], ["created_at", "2016-01-26 20:14:26.482923"], ["updated_at", "2016-01-26 20:14:26.482923"]]
---
  def create
    @board = Board.new(title: params[:board][:title])
    @board.author_id = current_user.id
    @board.save

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 1]]
---
  def destroy
    @board = Board.find_by_id(params[:id])
    @board.destroy

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @board = Board.find_by_id(params[:id])

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "boards" SET "title" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["title", "Test of update functions."], ["updated_at", "2016-01-26 20:21:09.748869"], ["id", 1]]
---
  def update
    @board = Board.find_by_id(params[:board][:id])
    @board.title = params[:board][:title]
    @board.save